beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_qspi.c

#include "custom_qspi.h"

#include "boards.h"
#include "nrf_drv_qspi.h"
#include "custom_ble_manager.h"
#include "custom_timer.h"

#include "custom_log.h"


#define QSPI_STD_CMD_WRSR   0x01
#define QSPI_STD_CMD_RSTEN  0x66
#define QSPI_STD_CMD_RST    0x99

#define QSPI_SECTOR_SIZE_BYTES      4096                     //User can erase a sector of 4096 Bytes
#define QSPI_NUMBER_BLOCKS          16                       //16 Blocks of 256 Bytes = Store 4096 Bytes ~ 4KB
#define QSPI_BLOCK_SIZE_BYTES       256                      //256 Bytes is the size of a block in memory
#define QSPI_BUFFER_SIZE_UINT8      QSPI_BLOCK_SIZE_BYTES/1  //256 elements in a buffer of uint8_t  (1 Bytes)
#define QSPI_BUFFER_SIZE_UINT16     QSPI_BLOCK_SIZE_BYTES/2  //128 elements in a buffer of uint16_t (2 Bytes)
#define QSPI_BUFFER_SIZE_UINT32     QSPI_BLOCK_SIZE_BYTES/4  // 64 elements in a buffer of uint32_t (4 Bytes)


#define QSPI_NUMBER_SECTORS_DETSYS  3                        //3 Sectors of 4096 Bytes (To write: I can erase sectors, not blocks)
#define QSPI_BUFFER_SIZE_DETSYSDAT  QSPI_BLOCK_SIZE_BYTES/32 //  8 elements in a buffer of detection_system_data (32 Bytes)
#define QSPI_OFFSET_DETSYS          0                        //Offset

#define QSPI_NUMBER_SECTORS_CONSYS  2                        //2 Sectors of 4096 Bytes ~ 4k Bytes
#define QSPI_BUFFER_SIZE_CONSYSDAT  QSPI_BLOCK_SIZE_BYTES/8  // 32 elements in a buffer of control_system_data (8 Bytes)
#define QSPI_OFFSET_CONSYS          QSPI_OFFSET_DETSYS + (QSPI_NUMBER_SECTORS_DETSYS*QSPI_SECTOR_SIZE_BYTES) //Offset

#define QSPI_NUMBER_SECTORS_BATSYS  2                        //2 Sectors of 4096 Bytes ~ 4k Bytes
#define QSPI_BUFFER_SIZE_BATSYSDAT  QSPI_BLOCK_SIZE_BYTES/16 // 16 elements in a buffer of battery_system_data (16 Bytes)
#define QSPI_OFFSET_BATSYS          QSPI_OFFSET_CONSYS + (QSPI_NUMBER_SECTORS_CONSYS*QSPI_SECTOR_SIZE_BYTES) //Offset


#define WAIT_FOR_PERIPH() do { \
        while (!m_finished) {} \
        m_finished = false;    \
    } while (0)



static volatile bool m_finished = false;

static void qspi_handler(nrf_drv_qspi_evt_t event, void * p_context)
{
    UNUSED_PARAMETER(event);
    UNUSED_PARAMETER(p_context);
    m_finished = true;
}

static void configure_memory(void)
{
    ret_code_t err_code;
    
    uint8_t temporary = 0x40;
    nrf_qspi_cinstr_conf_t cinstr_cfg = {
        .opcode    = QSPI_STD_CMD_RSTEN,
        .length    = NRF_QSPI_CINSTR_LEN_1B,
        .io2_level = true,
        .io3_level = true,
        .wipwait   = true,
        .wren      = true
    };

    // Send reset enable
    err_code = nrf_drv_qspi_cinstr_xfer(&cinstr_cfg, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    // Send reset command
    cinstr_cfg.opcode = QSPI_STD_CMD_RST;
    err_code = nrf_drv_qspi_cinstr_xfer(&cinstr_cfg, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    // Switch to qspi mode
    cinstr_cfg.opcode = QSPI_STD_CMD_WRSR;
    cinstr_cfg.length = NRF_QSPI_CINSTR_LEN_2B;
    err_code = nrf_drv_qspi_cinstr_xfer(&cinstr_cfg, &temporary, NULL);
    APP_ERROR_CHECK(err_code);
}


void qspiInit(void)
{
    ret_code_t err_code;

    nrf_drv_qspi_config_t config = NRF_DRV_QSPI_DEFAULT_CONFIG;
    err_code = nrf_drv_qspi_init(&config, qspi_handler, NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("QSPI started.");

    configure_memory();

    m_finished = false;

    //Erase NUMBER_PIECES pices of 65536 bytes ~ 64k bytes: 
    uint8_t indexPiece;
    uint8_t NUMBER_PIECES = 1;
    uint32_t PIECE_SIZE_BYTES = 65536;
    for(indexPiece = 0; indexPiece < NUMBER_PIECES; indexPiece++){
        uint32_t flashAddress = (indexPiece*PIECE_SIZE_BYTES) + QSPI_OFFSET_DETSYS;
        err_code = nrf_drv_qspi_erase(NRF_QSPI_ERASE_LEN_64KB, flashAddress);
        APP_ERROR_CHECK(err_code);
        WAIT_FOR_PERIPH();
        NRF_LOG_INFO("External Flash Erased. indexPiece: %d. flashAddress = %d.", indexPiece, flashAddress);
    }

}


///////////////////////////////////////////////////////////////////////////////////////////
/// For Detection System //////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////

//Declare static variables:
static uint32_t indexBuffer_write = 0;
static uint32_t indexBlock_write = 0;
static uint32_t indexSector_write = 0;
static detection_system_data mBuffer_write[QSPI_BUFFER_SIZE_DETSYSDAT];

void qspiDetectionSystem_PushSampleInExternalFlash(detection_system_data sample)
{
    ret_code_t err_code;
 
    //Write an new element in the buffer:
    mBuffer_write[indexBuffer_write] = sample;
    NRF_LOG_INFO("Write in buffer. indexBuffer_write: %d. timeValue: %d.", indexBuffer_write, mBuffer_write[indexBuffer_write].time[0]);

    //If the buffer is complete:
    if(indexBuffer_write == (QSPI_BUFFER_SIZE_DETSYSDAT-1))
    {
        //Write the data buffer in a memory block:
        uint32_t flashAddress = (indexSector_write*QSPI_SECTOR_SIZE_BYTES) + (indexBlock_write*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_DETSYS;
        err_code = nrf_drv_qspi_write(&mBuffer_write, QSPI_BLOCK_SIZE_BYTES, flashAddress);
        APP_ERROR_CHECK(err_code);
        WAIT_FOR_PERIPH();
        NRF_LOG_INFO("Writing. indexSector_write: %d. indexBlock_write: %d, flashAddress: %d", indexSector_write, indexBlock_write, flashAddress);

        //If the sector is complete:
        if(indexBlock_write == (QSPI_NUMBER_BLOCKS-1))
        {
            //Update memory sector index to write:
            indexSector_write = (indexSector_write+1) % ((uint32_t) QSPI_NUMBER_SECTORS_DETSYS);
        }

        //Update memory block index to write:
        indexBlock_write = (indexBlock_write+1) % ((uint32_t) QSPI_NUMBER_BLOCKS);
    }
    
    //Update counter of the buffer:
    indexBuffer_write = (indexBuffer_write+1) % ((uint32_t) QSPI_BUFFER_SIZE_DETSYSDAT);

}

static uint32_t indexBuffer_read = 0;
static uint32_t indexBlock_read = 0;
static uint32_t indexSector_read = 0;


static uint32_t qspiDetectionSystem_WriteReadBufferDistance(void)
{
    uint32_t indexBuffer_writeAux           = indexBuffer_write + (QSPI_BUFFER_SIZE_DETSYSDAT*(indexBlock_write + (QSPI_NUMBER_BLOCKS*indexSector_write)));
    uint32_t indexBuffer_readAux            = indexBuffer_read + (QSPI_BUFFER_SIZE_DETSYSDAT*(indexBlock_read  + (QSPI_NUMBER_BLOCKS*indexSector_read)));
    uint32_t QSPI_BUFFER_SIZE_DETSYSDAT_AUX = QSPI_BUFFER_SIZE_DETSYSDAT*(QSPI_NUMBER_BLOCKS*QSPI_NUMBER_SECTORS_DETSYS);

    uint32_t writeReadBufferDistance = ((QSPI_BUFFER_SIZE_DETSYSDAT_AUX-1) - ((indexBuffer_readAux + ((QSPI_BUFFER_SIZE_DETSYSDAT_AUX-1)-indexBuffer_writeAux)) % ((uint32_t) QSPI_BUFFER_SIZE_DETSYSDAT_AUX)));
    return writeReadBufferDistance;
}


void qspiDetectionSystem_ReadExternalFlashAndSendBleDataIfPossible(void){

    ret_code_t err_code;

