beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_qspi.c
    //Declare static variables:
    static detection_system_data m_buffer_rx[QSPI_BUFFER_SIZE_DETSYSDAT];
    static bool isThereRxBufferSavedFromFlash = false;

    //If there is a m_buffer_rx saved from the flash, then send BT data as soon as possible until the the buffer is totally read:
    if(isThereRxBufferSavedFromFlash)
    {
        static uint8_t indexBleData = 0;

        //Send data via BT from the m_buffer_rx:
        detection_system_single_data bleData = detectionSystem_getStructSingleData(m_buffer_rx[indexBuffer_read], indexBleData);
        bleCusSensSendData(bleData);
        NRF_LOG_INFO("BLE SENS SERVICE: send. Read from Buffer_read. indexBleData: %d. indexBuffer_read: %d. timeValue[%d]: %d", indexBleData, indexBuffer_read, indexBleData, bleData.time);
        
        //If it is sent the last BT data:
        if(indexBleData == (4-1))
        {
            //If it is send the last of the read buffer:
            if(indexBuffer_read == (QSPI_BUFFER_SIZE_DETSYSDAT-1))
            {   
                //There is no longer a m_buffer_rx to read:
                isThereRxBufferSavedFromFlash = false;
            
                //If it is read the last block from flash memory:
                if(indexBlock_read == (QSPI_NUMBER_BLOCKS-1))
                {
                    //Then erase the last sector of 4KB already read:
                    uint32_t flashAddress = (indexSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_DETSYS;
                    err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                    APP_ERROR_CHECK(err_code);
                    WAIT_FOR_PERIPH();
                    NRF_LOG_INFO("**********************************************************************");
                    NRF_LOG_INFO("*** Sector of 4KB erased. indexSector: %d. flashAddres: %d", indexSector_read, flashAddress);
                    NRF_LOG_INFO("**********************************************************************");
                
                    //Update memory sector index to read:
                    indexSector_read = (indexSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_DETSYS);    
                }
                //Update memory block index to read:
                indexBlock_read = (indexBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
            }
            //Update the buffer index to read:
            indexBuffer_read = (indexBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_DETSYSDAT);
        }
        //Update the index of the BT data to send:
        indexBleData = (indexBleData+1) % ((uint8_t) 4);

    }
    //If there is not a m_buffer_rx saved from the flash, then check how larger is the distance
    else
    {
        uint32_t distanceWriteReadBuffer = qspiDetectionSystem_WriteReadBufferDistance();

        //If the distance is larger enough, then read the memory flash an store data in the m_buffer_rx
        if(distanceWriteReadBuffer >= QSPI_BUFFER_SIZE_DETSYSDAT)
        {
            //Read a memory block from flash:
            uint32_t flashAddress = (indexSector_read*QSPI_SECTOR_SIZE_BYTES) + (indexBlock_read*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_DETSYS;
            err_code = nrf_drv_qspi_read(m_buffer_rx, QSPI_BLOCK_SIZE_BYTES, flashAddress);
            WAIT_FOR_PERIPH();
            NRF_LOG_INFO("Reading. indexSector_read: %d. indexBlock_read: %d, flashAddress: %d", indexSector_read, indexBlock_read, flashAddress);

            //Now there is a m_buffer_rx to read:
            isThereRxBufferSavedFromFlash = true;
        }
        else if(distanceWriteReadBuffer > 0)
        {
            static uint8_t indexBleData = 0;

            //Send data via BT from the mBuffer_write:
            detection_system_single_data bleData = detectionSystem_getStructSingleData(mBuffer_write[indexBuffer_read], indexBleData);
            bleCusSensSendData(bleData);
            NRF_LOG_INFO("BLE SENS SERVICE: send. Read from Buffer_write. indexBleData: %d. indexBuffer_read: %d. timeValue[%d]: %d", indexBleData, indexBuffer_read, indexBleData, bleData.time);

            //If it is sent the last BT data:
            if(indexBleData == (4-1))
            {
                //Update index for reading:
                if(indexBuffer_read == (QSPI_BUFFER_SIZE_DETSYSDAT-1))
                {
                    //If it is read the last block from flash memory (actually, the flash is not directly read):
                    if(indexBlock_read == (QSPI_NUMBER_BLOCKS-1))
                    {
                        //Then erase the last sector of 4KB already read:
                        uint32_t flashAddress = (indexSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_DETSYS;
                        err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                        APP_ERROR_CHECK(err_code);
                        WAIT_FOR_PERIPH();
                        NRF_LOG_INFO("**********************************************************************");
                        NRF_LOG_INFO("*** Sector of 4KB erased. indexSector: %d. flashAddres: %d", indexSector_read, flashAddress);
                        NRF_LOG_INFO("**********************************************************************");
                

                        //Update memory sector index to read:
                        indexSector_read = (indexSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_DETSYS);    
                    }
                    //Update memory block index to read:
                    indexBlock_read = (indexBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
                }
                //Update the buffer index to read:
                indexBuffer_read = (indexBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_DETSYSDAT);
            }
            //Update the index of the BT data to send:
            indexBleData = (indexBleData+1) % ((uint8_t) 4);
        }
        //If it is the last data, if it is not measuring and there is still data on flash for "Sens" (data on flash means there is still data to send)
        else if(!deviceStatus_getStructData_isMeasuring() && deviceStatus_getStructData_isSensDataOnFlash())
        {
            //Update device status data for "isSensDataOnFlash":
            deviceStatus_saveStructData_isSensDataOnFlash(false);
            NRF_LOG_INFO("FLASH: isSensDataOnFlash = %d.", deviceStatus_getStructData_isSensDataOnFlash());

            //If there is not data on flash for "Cont" nor "Batt" either: 
            if(!deviceStatus_getStructData_isContDataOnFlash() && !deviceStatus_getStructData_isBattDataOnFlash())
            {
                //Stop the millis Timer and update the internal device status data:
                hundredMillisStop();
                deviceStatus_saveStructData_isDataOnFlash(false);
                deviceStatus_saveStructData_fileName(0,0,0,0,0,0);
                NRF_LOG_INFO("FLASH: isDataOnFlash = %d.", deviceStatus_getStructData_isDataOnFlash());

                //Update device status and notify STAT characteristic:
                bleCusStatSendData(deviceStatus_getStructData());
                NRF_LOG_INFO("FLASH: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());
            }
                                                    
