beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_qspi.c
        }

    }
    

}


///////////////////////////////////////////////////////////////////////////////////////////
/// For Controller System /////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
//Declare static variables:
static uint32_t indBuffer_write = 0;
static uint32_t indBlock_write = 0;
static uint32_t indSector_write = 0;
static control_system_data mBuff_write[QSPI_BUFFER_SIZE_CONSYSDAT];

void qspiControlSystem_PushSampleInExternalFlash(control_system_data sample)
{
    ret_code_t err_code;
 
    //Write an new element in the buffer:
    mBuff_write[indBuffer_write] = sample;
    NRF_LOG_INFO("QSPI_CONT: Write in buffer. indBuffer_write: %d. timeValue: %d.", indBuffer_write, mBuff_write[indBuffer_write].time);

    //If the buffer is complete:
    if(indBuffer_write == (QSPI_BUFFER_SIZE_CONSYSDAT-1))
    {
        //Write the data buffer in a memory block:
        uint32_t flashAddress = (indSector_write*QSPI_SECTOR_SIZE_BYTES) + (indBlock_write*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_CONSYS;
        err_code = nrf_drv_qspi_write(&mBuff_write, QSPI_BLOCK_SIZE_BYTES, flashAddress);
        APP_ERROR_CHECK(err_code);
        WAIT_FOR_PERIPH();
        NRF_LOG_INFO("QSPI_CONT: Writing. indSector_write: %d. indBlock_write: %d, flashAddress: %d", indSector_write, indBlock_write, flashAddress);

        //If the sector is complete:
        if(indBlock_write == (QSPI_NUMBER_BLOCKS-1))
        {
            //Update memory sector ind to write:
            indSector_write = (indSector_write+1) % ((uint32_t) QSPI_NUMBER_SECTORS_CONSYS);
        }

        //Update memory block ind to write:
        indBlock_write = (indBlock_write+1) % ((uint32_t) QSPI_NUMBER_BLOCKS);
    }
    
    //Update counter of the buffer:
    indBuffer_write = (indBuffer_write+1) % ((uint32_t) QSPI_BUFFER_SIZE_CONSYSDAT);

}


static uint32_t indBuffer_read = 0;
static uint32_t indBlock_read = 0;
static uint32_t indSector_read = 0;


static uint32_t qspiControlSystem_WriteReadBufferDistance(void)
{
    uint32_t indBuffer_writeAux = indBuffer_write + (QSPI_BUFFER_SIZE_CONSYSDAT*(indBlock_write + (QSPI_NUMBER_BLOCKS*indSector_write)));
    uint32_t indBuffer_readAux  = indBuffer_read + (QSPI_BUFFER_SIZE_CONSYSDAT*(indBlock_read  + (QSPI_NUMBER_BLOCKS*indSector_read)));
    uint32_t QSPI_BUFFER_SIZE_CONSYSDAT_AUX = QSPI_BUFFER_SIZE_CONSYSDAT*(QSPI_NUMBER_BLOCKS*QSPI_NUMBER_SECTORS_CONSYS);

    uint32_t writeReadBufferDistance = ((QSPI_BUFFER_SIZE_CONSYSDAT_AUX-1) - ((indBuffer_readAux + ((QSPI_BUFFER_SIZE_CONSYSDAT_AUX-1)-indBuffer_writeAux)) % ((uint32_t) QSPI_BUFFER_SIZE_CONSYSDAT_AUX)));
    return writeReadBufferDistance;
}


void qspiControlSystem_ReadExternalFlashAndSendBleDataIfPossible(void){

    ret_code_t err_code;

    //Declare static variables:
    static control_system_data m_buffer_rx[QSPI_BUFFER_SIZE_CONSYSDAT];
    static bool isThereRxBufferSavedFromFlash = false;

    //If there is a m_buffer_rx saved from the flash, then send BT data as soon as possible until the the buffer is totally read:
    if(isThereRxBufferSavedFromFlash)
    {
        //Send data via BT from the m_buffer_rx:
        control_system_data bleData = m_buffer_rx[indBuffer_read];
        bleCusContSendData(bleData);
        NRF_LOG_INFO("BLE CONT SERVICE: send. Read from Buffer_read. indBuffer_read: %d. time: %d", indBuffer_read, bleData.time);
        
        
        //If it is send the last of the read buffer:
        if(indBuffer_read == (QSPI_BUFFER_SIZE_CONSYSDAT-1))
        {   
            //There is no longer a m_buffer_rx to read:
            isThereRxBufferSavedFromFlash = false;
           
            //If it is read the last block from flash memory:
            if(indBlock_read == (QSPI_NUMBER_BLOCKS-1))
            {
                //Then erase the last sector of 4KB already read:
                uint32_t flashAddress = (indSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_CONSYS;
                err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                APP_ERROR_CHECK(err_code);
                WAIT_FOR_PERIPH();
                NRF_LOG_INFO("**********************************************************************");
                NRF_LOG_INFO("*** QSPI_CONT: Sector of 4KB erased. indSector: %d. flashAddres: %d", indSector_read, flashAddress);
                NRF_LOG_INFO("**********************************************************************");
                
                //Update memory sector ind to read:
                indSector_read = (indSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_CONSYS);    
            }
            //Update memory block ind to read:
            indBlock_read = (indBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
        }
        //Update the buffer ind to read:
        indBuffer_read = (indBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_CONSYSDAT);

    }
    //If there is not a m_buffer_rx saved from the flash, then check how larger is the distance
    else
    {
        uint32_t distanceWriteReadBuffer = qspiControlSystem_WriteReadBufferDistance();

        //If the distance is large enough, then read the memory flash an store data in the m_buffer_rx
        if(distanceWriteReadBuffer >= QSPI_BUFFER_SIZE_CONSYSDAT)
        {
            //Read a memory block from flash:
            uint32_t flashAddress = (indSector_read*QSPI_SECTOR_SIZE_BYTES) + (indBlock_read*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_CONSYS;
            err_code = nrf_drv_qspi_read(m_buffer_rx, QSPI_BLOCK_SIZE_BYTES, flashAddress);
            WAIT_FOR_PERIPH();
            NRF_LOG_INFO("QSPI_CONT: Reading. indSector_read: %d. indBlock_read: %d, flashAddress: %d", indSector_read, indBlock_read, flashAddress);

            //Now there is a m_buffer_rx to read:
            isThereRxBufferSavedFromFlash = true;
        }
        else if(distanceWriteReadBuffer > 0)
        {
            //Send data via BT from the mBuff_write:
            control_system_data bleData = mBuff_write[indBuffer_read];
            bleCusContSendData(bleData);
            NRF_LOG_INFO("BLE CONT SERVICE: send. Read from Buffer_write. indBuffer_read: %d. time: %d", indBuffer_read, bleData.time);

            //Update ind for reading:
            if(indBuffer_read == (QSPI_BUFFER_SIZE_CONSYSDAT-1))
            {
                //If it is read the last block from flash memory (actually, the flash is not directly read):
                if(indBlock_read == (QSPI_NUMBER_BLOCKS-1))
                {
                    //Then erase the last sector of 4KB already read:
                    uint32_t flashAddress = (indSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_CONSYS;
                    err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                    APP_ERROR_CHECK(err_code);
                    WAIT_FOR_PERIPH();
                    NRF_LOG_INFO("**********************************************************************");
                    NRF_LOG_INFO("*** QSPI_CONT: Sector of 4KB erased. indSector: %d. flashAddres: %d", indSector_read, flashAddress);
                    NRF_LOG_INFO("**********************************************************************");
                

                    //Update memory sector ind to read:
                    indSector_read = (indSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_CONSYS);    
                }
                //Update memory block ind to read:
                indBlock_read = (indBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
            }
            //Update the buffer ind to read:
            indBuffer_read = (indBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_CONSYSDAT);

