beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_qspi.c
        }
        //If it is the last data, if it is not measuring and there is still data on flash for "Cont" (data on flash means there is still data to send)
        else if(!deviceStatus_getStructData_isMeasuring() && deviceStatus_getStructData_isContDataOnFlash())
        {
            //Update device status data for "isContDataOnFlash":
            deviceStatus_saveStructData_isContDataOnFlash(false);
            NRF_LOG_INFO("FLASH: isContDataOnFlash = %d.", deviceStatus_getStructData_isContDataOnFlash());

            //If there is not data on flash for "Sens" nor "Batt" either: 
            if(!deviceStatus_getStructData_isSensDataOnFlash() && !deviceStatus_getStructData_isBattDataOnFlash())
            {
                //Stop the millis Timer and update the internal device status data:
                hundredMillisStop();
                deviceStatus_saveStructData_isDataOnFlash(false);
                deviceStatus_saveStructData_fileName(0,0,0,0,0,0);
                NRF_LOG_INFO("FLASH: isDataOnFlash = %d.", deviceStatus_getStructData_isDataOnFlash());
            
                //Update device status and notify STAT characteristic:
                bleCusStatSendData(deviceStatus_getStructData());
                NRF_LOG_INFO("FLASH: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());                             
            }

        }

    }
    
}


////////////////////////////////////////////////////////////////////////////////////////
/// For Battery System /////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////
//Declare static variables:
static uint32_t idxBuffer_write = 0;
static uint32_t idxBlock_write = 0;
static uint32_t idxSector_write = 0;
static battery_system_data mBufr_write[QSPI_BUFFER_SIZE_BATSYSDAT];

void qspiBatterySystem_PushSampleInExternalFlash(battery_system_data sample)
{
    ret_code_t err_code;
 
    //Write an new element in the buffer:
    mBufr_write[idxBuffer_write] = sample;
    NRF_LOG_INFO("QSPI_BATT: Write in buffer. idxBuffer_write: %d. timeValue: %d.", idxBuffer_write, mBufr_write[idxBuffer_write].time);

    //If the buffer is complete:
    if(idxBuffer_write == (QSPI_BUFFER_SIZE_BATSYSDAT-1))
    {
        //Write the data buffer in a memory block:
        uint32_t flashAddress = (idxSector_write*QSPI_SECTOR_SIZE_BYTES) + (idxBlock_write*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_BATSYS;
        err_code = nrf_drv_qspi_write(&mBufr_write, QSPI_BLOCK_SIZE_BYTES, flashAddress);
        APP_ERROR_CHECK(err_code);
        WAIT_FOR_PERIPH();
        NRF_LOG_INFO("QSPI_BATT: Writing. idxSector_write: %d. idxBlock_write: %d, flashAddress: %d", idxSector_write, idxBlock_write, flashAddress);

        //If the sector is complete:
        if(idxBlock_write == (QSPI_NUMBER_BLOCKS-1))
        {
            //Update memory sector idx to write:
            idxSector_write = (idxSector_write+1) % ((uint32_t) QSPI_NUMBER_SECTORS_BATSYS);
        }

        //Update memory block idx to write:
        idxBlock_write = (idxBlock_write+1) % ((uint32_t) QSPI_NUMBER_BLOCKS);
    }
    
    //Update counter of the buffer:
    idxBuffer_write = (idxBuffer_write+1) % ((uint32_t) QSPI_BUFFER_SIZE_BATSYSDAT);

}


static uint32_t idxBuffer_read = 0;
static uint32_t idxBlock_read = 0;
static uint32_t idxSector_read = 0;

static uint32_t qspiBatterySystem_WriteReadBufferDistance(void)
{
    uint32_t idxBuffer_writeAux = idxBuffer_write + (QSPI_BUFFER_SIZE_BATSYSDAT*(idxBlock_write + (QSPI_NUMBER_BLOCKS*idxSector_write)));
    uint32_t idxBuffer_readAux  = idxBuffer_read + (QSPI_BUFFER_SIZE_BATSYSDAT*(idxBlock_read  + (QSPI_NUMBER_BLOCKS*idxSector_read)));
    uint32_t QSPI_BUFFER_SIZE_BATSYSDAT_AUX = QSPI_BUFFER_SIZE_BATSYSDAT*(QSPI_NUMBER_BLOCKS*QSPI_NUMBER_SECTORS_BATSYS);

    uint32_t writeReadBufferDistance = ((QSPI_BUFFER_SIZE_BATSYSDAT_AUX-1) - ((idxBuffer_readAux + ((QSPI_BUFFER_SIZE_BATSYSDAT_AUX-1)-idxBuffer_writeAux)) % ((uint32_t) QSPI_BUFFER_SIZE_BATSYSDAT_AUX)));
    return writeReadBufferDistance;
}


void qspiBatterySystem_ReadExternalFlashAndSendBleDataIfPossible(void){

    ret_code_t err_code;

    //Declare static variables:
    static battery_system_data m_buffer_rx[QSPI_BUFFER_SIZE_BATSYSDAT];
    static bool isThereRxBufferSavedFromFlash = false;

    //If there is a m_buffer_rx saved from the flash, then send BT data as soon as possible until the the buffer is totally read:
    if(isThereRxBufferSavedFromFlash)
    {
        //Send data via BT from the m_buffer_rx:
        battery_system_data bleData = m_buffer_rx[idxBuffer_read];
        bleCusBattSendData(bleData);
        NRF_LOG_INFO("BLE BATT SERVICE: send. Read from Buffer_read. idxBuffer_read: %d. time: %d", idxBuffer_read, bleData.time);
        
        
        //If it is send the last of the read buffer:
        if(idxBuffer_read == (QSPI_BUFFER_SIZE_BATSYSDAT-1))
        {   
            //There is no longer a m_buffer_rx to read:
            isThereRxBufferSavedFromFlash = false;
           
            //If it is read the last block from flash memory:
            if(idxBlock_read == (QSPI_NUMBER_BLOCKS-1))
            {
                //Then erase the last sector of 4KB already read:
                uint32_t flashAddress = (idxSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_BATSYS;
                err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                APP_ERROR_CHECK(err_code);
                WAIT_FOR_PERIPH();
                NRF_LOG_INFO("**********************************************************************");
                NRF_LOG_INFO("*** QSPI_BATT: Sector of 4KB erased. idxSector: %d. flashAddres: %d", idxSector_read, flashAddress);
                NRF_LOG_INFO("**********************************************************************");
                
                //Update memory sector idx to read:
                idxSector_read = (idxSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_BATSYS);    
            }
            //Update memory block idx to read:
            idxBlock_read = (idxBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
        }
        //Update the buffer idx to read:
        idxBuffer_read = (idxBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_BATSYSDAT);

