beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_qspi.c
    }
    //If there is not a m_buffer_rx saved from the flash, then check how larger is the distance
    else
    {
        uint32_t distanceWriteReadBuffer = qspiBatterySystem_WriteReadBufferDistance();

        //If the distance is large enough, then read the memory flash an store data in the m_buffer_rx
        if(distanceWriteReadBuffer >= QSPI_BUFFER_SIZE_BATSYSDAT)
        {
            //Read a memory block from flash:
            uint32_t flashAddress = (idxSector_read*QSPI_SECTOR_SIZE_BYTES) + (idxBlock_read*QSPI_BLOCK_SIZE_BYTES) + QSPI_OFFSET_BATSYS;
            err_code = nrf_drv_qspi_read(m_buffer_rx, QSPI_BLOCK_SIZE_BYTES, flashAddress);
            WAIT_FOR_PERIPH();
            NRF_LOG_INFO("QSPI_BATT: Reading. idxSector_read: %d. idxBlock_read: %d, flashAddress: %d", idxSector_read, idxBlock_read, flashAddress);

            //Now there is a m_buffer_rx to read:
            isThereRxBufferSavedFromFlash = true;
        }
        else if(distanceWriteReadBuffer > 0)
        {
            //Send data via BT from the mBufr_write:
            battery_system_data bleData = mBufr_write[idxBuffer_read];
            bleCusBattSendData(bleData);
            NRF_LOG_INFO("BLE BATT SERVICE: send. Read from Buffer_write. idxBuffer_read: %d. time: %d", idxBuffer_read, bleData.time);

            //Update idx for reading:
            if(idxBuffer_read == (QSPI_BUFFER_SIZE_BATSYSDAT-1))
            {
                //If it is read the last block from flash memory (actually, the flash is not directly read):
                if(idxBlock_read == (QSPI_NUMBER_BLOCKS-1))
                {
                    //Then erase the last sector of 4KB already read:
                    uint32_t flashAddress = (idxSector_read*QSPI_SECTOR_SIZE_BYTES) + QSPI_OFFSET_BATSYS;
                    err_code = nrf_drv_qspi_erase(QSPI_ERASE_LEN_LEN_4KB, flashAddress);
                    APP_ERROR_CHECK(err_code);
                    WAIT_FOR_PERIPH();
                    NRF_LOG_INFO("**********************************************************************");
                    NRF_LOG_INFO("*** QSPI_BATT: Sector of 4KB erased. idxSector: %d. flashAddres: %d", idxSector_read, flashAddress);
                    NRF_LOG_INFO("**********************************************************************");
                

                    //Update memory sector idx to read:
                    idxSector_read = (idxSector_read+1) % ((uint32_t) QSPI_NUMBER_SECTORS_BATSYS);    
                }
                //Update memory block idx to read:
                idxBlock_read = (idxBlock_read+1) % ((uint32_t) QSPI_NUMBER_BLOCKS); 
            }
            //Update the buffer idx to read:
            idxBuffer_read = (idxBuffer_read+1) % ((uint32_t) QSPI_BUFFER_SIZE_BATSYSDAT);

        }
        //If it is the last data, if it is not measuring and there is still data on flash for "Batt" (data on flash means there is still data to send)
        else if(!deviceStatus_getStructData_isMeasuring() && deviceStatus_getStructData_isBattDataOnFlash())
        {
            //Update device status data for "isBattDataOnFlash":
            deviceStatus_saveStructData_isBattDataOnFlash(false);
            NRF_LOG_INFO("FLASH: isBattDataOnFlash = %d.", deviceStatus_getStructData_isBattDataOnFlash());

            //If there is not data on flash for "Sens" nor for "Cont" either: 
            if(!deviceStatus_getStructData_isSensDataOnFlash() && !deviceStatus_getStructData_isContDataOnFlash())
            {
                //Stop the millis Timer and update the internal device status data:
                hundredMillisStop();
                deviceStatus_saveStructData_isDataOnFlash(false);
                deviceStatus_saveStructData_fileName(0,0,0,0,0,0);
                NRF_LOG_INFO("FLASH: isDataOnFlash = %d.", deviceStatus_getStructData_isDataOnFlash());
            
                //Update device status and notify STAT characteristic:
                bleCusStatSendData(deviceStatus_getStructData());
                NRF_LOG_INFO("FLASH: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());                             
            }

        }
        
    }
    
}